[
  {
    "id": "listening-ielts-001",
    "title_jp": "Library Registration",
    "title_id": "Pendaftaran Perpustakaan",
    "audio_url": null,
    "transcript_jp": "Librarian: Good morning! Welcome to the university library. How can I help you today?\n\nStudent: Hi, I'm a new student and I'd like to register for a library card, please.\n\nLibrarian: Of course! I'll just need a few details from you. Could I have your full name and student ID number?\n\nStudent: Sure, my name is Sarah Chen, and my student ID is 2024-0847.\n\nLibrarian: Perfect. And which faculty are you enrolled in?\n\nStudent: I'm in the Faculty of Science, studying Environmental Biology.\n\nLibrarian: Great. Now, with your library card, you'll be able to borrow up to ten books at a time. The standard loan period is three weeks, but you can renew items online up to two times if no one else has requested them.\n\nStudent: That sounds good. What about the electronic resources? I'll need access to online journals for my coursework.\n\nLibrarian: Absolutely. Your library card gives you full access to all our digital databases and e-journals. You can access them from any computer on campus, or from home using your student login credentials.\n\nStudent: Wonderful. And are there any quiet study areas I can use?\n\nLibrarian: Yes, we have individual study rooms on the third floor that you can book for up to four hours at a time. There's also a silent study zone on the second floor that's available on a first-come, first-served basis.\n\nStudent: That's really helpful. One more question — what are the library's opening hours?\n\nLibrarian: We're open Monday to Friday from 8 AM to 10 PM, and on weekends from 9 AM to 6 PM. During exam periods, we extend our hours until midnight on weekdays.\n\nStudent: Perfect, thank you so much for all the information!\n\nLibrarian: You're welcome! Your card should be ready in about five minutes. Please take a seat and I'll call you when it's done.",
    "transcript_reading": null,
    "transcript_id": "Pustakawan: Selamat pagi! Selamat datang di perpustakaan universitas. Ada yang bisa saya bantu hari ini?\n\nMahasiswa: Halo, saya mahasiswa baru dan saya ingin mendaftar untuk kartu perpustakaan.\n\nPustakawan: Tentu! Saya hanya perlu beberapa informasi dari Anda. Boleh saya minta nama lengkap dan nomor identitas mahasiswa Anda?\n\nMahasiswa: Tentu, nama saya Sarah Chen, dan ID mahasiswa saya 2024-0847.\n\nPustakawan: Sempurna. Dan Anda terdaftar di fakultas apa?\n\nMahasiswa: Saya di Fakultas Sains, jurusan Biologi Lingkungan.\n\nPustakawan: Bagus. Dengan kartu perpustakaan Anda, Anda bisa meminjam hingga sepuluh buku sekaligus. Masa pinjam standar adalah tiga minggu, tetapi Anda bisa memperpanjang secara online hingga dua kali jika tidak ada orang lain yang meminta buku tersebut.\n\nMahasiswa: Kedengarannya bagus. Bagaimana dengan sumber daya elektronik? Saya akan membutuhkan akses ke jurnal online untuk tugas kuliah saya.\n\nPustakawan: Tentu saja. Kartu perpustakaan Anda memberikan akses penuh ke semua database digital dan e-jurnal kami. Anda bisa mengaksesnya dari komputer mana pun di kampus, atau dari rumah menggunakan kredensial login mahasiswa Anda.\n\nMahasiswa: Luar biasa. Dan apakah ada area belajar yang tenang yang bisa saya gunakan?\n\nPustakawan: Ya, kami memiliki ruang belajar individual di lantai tiga yang bisa Anda pesan hingga empat jam sekaligus. Ada juga zona belajar hening di lantai dua yang tersedia berdasarkan siapa yang datang lebih dulu.\n\nMahasiswa: Itu sangat membantu. Satu pertanyaan lagi — jam berapa perpustakaan buka?\n\nPustakawan: Kami buka Senin sampai Jumat dari jam 8 pagi sampai 10 malam, dan di akhir pekan dari jam 9 pagi sampai 6 sore. Selama periode ujian, kami memperpanjang jam buka sampai tengah malam di hari kerja.\n\nMahasiswa: Sempurna, terima kasih banyak atas semua informasinya!\n\nPustakawan: Sama-sama! Kartu Anda seharusnya siap dalam sekitar lima menit. Silakan duduk dan saya akan memanggil Anda ketika sudah selesai.",
    "jlpt_level": null,
    "category": "conversation",
    "difficulty": 1,
    "duration_seconds": 75,
    "speakers": 2,
    "is_premium": false,
    "order_index": 1,
    "track": "ielts"
  },
  {
    "id": "listening-ielts-002",
    "title_jp": "Campus Tour Guide",
    "title_id": "Pemandu Tur Kampus",
    "audio_url": null,
    "transcript_jp": "Guide: Welcome, everyone! My name is Tom, and I'll be showing you around the campus today. Let's start here at the main entrance. This building on your left is the Administration Block, where you'll find the admissions office, student services, and the financial aid department.\n\nStudent: Excuse me, Tom. Is the international students' office also in that building?\n\nGuide: Good question! No, the international students' office actually moved to the new Student Hub last year. That's the modern glass building we'll see shortly. It's much more convenient now because the Student Hub also houses the careers center, the counseling service, and several student club offices.\n\nStudent: Oh, that's useful to know. Thanks.\n\nGuide: Now, if you look straight ahead, you can see the Science Complex. It was renovated two years ago and now includes state-of-the-art laboratories for chemistry, physics, and biology. There's also a dedicated computer lab on the ground floor that's open twenty-four hours during term time.\n\nStudent: Are the labs available for undergraduate students to use outside of class hours?\n\nGuide: Yes, but you'll need to book a slot through the online booking system. Your department coordinator can give you access. Moving on, to our right is the Sports Center. We have an Olympic-sized swimming pool, a fully equipped gymnasium, tennis courts, and a football pitch. All students get free access with their student ID card.\n\nStudent: That's impressive. What about dining options on campus?\n\nGuide: Great question. We have three main dining facilities. The largest is the Central Cafeteria, which serves breakfast, lunch, and dinner. There's also a smaller cafe in the library building that's popular for coffee and light snacks, and a food court near the Student Hub with various international cuisine options. Most students find the food court their favorite spot.\n\nStudent: Sounds wonderful. I can't wait to start here!",
    "transcript_reading": null,
    "transcript_id": "Pemandu: Selamat datang, semuanya! Nama saya Tom, dan saya akan menunjukkan kampus kepada kalian hari ini. Mari kita mulai di sini, di pintu masuk utama. Bangunan di sebelah kiri kalian adalah Blok Administrasi, di mana kalian bisa menemukan kantor penerimaan, layanan mahasiswa, dan departemen bantuan keuangan.\n\nMahasiswa: Permisi, Tom. Apakah kantor mahasiswa internasional juga ada di bangunan itu?\n\nPemandu: Pertanyaan bagus! Tidak, kantor mahasiswa internasional sebenarnya pindah ke Student Hub baru tahun lalu. Itu adalah bangunan kaca modern yang akan segera kita lihat. Sekarang jauh lebih nyaman karena Student Hub juga menampung pusat karier, layanan konseling, dan beberapa kantor klub mahasiswa.\n\nMahasiswa: Oh, itu berguna untuk diketahui. Terima kasih.\n\nPemandu: Sekarang, jika kalian melihat lurus ke depan, kalian bisa melihat Kompleks Sains. Direnovasi dua tahun yang lalu dan sekarang memiliki laboratorium mutakhir untuk kimia, fisika, dan biologi. Ada juga lab komputer khusus di lantai dasar yang buka dua puluh empat jam selama masa kuliah.\n\nMahasiswa: Apakah lab tersedia untuk mahasiswa sarjana digunakan di luar jam kuliah?\n\nPemandu: Ya, tetapi kalian perlu memesan slot melalui sistem pemesanan online. Koordinator departemen kalian bisa memberikan akses. Melanjutkan, di sebelah kanan kita adalah Pusat Olahraga. Kami memiliki kolam renang berukuran Olimpiade, pusat kebugaran lengkap, lapangan tenis, dan lapangan sepak bola. Semua mahasiswa mendapat akses gratis dengan kartu identitas mahasiswa.\n\nMahasiswa: Itu mengesankan. Bagaimana dengan pilihan makan di kampus?\n\nPemandu: Pertanyaan bagus. Kami memiliki tiga fasilitas makan utama. Yang terbesar adalah Kafetaria Pusat, yang menyajikan sarapan, makan siang, dan makan malam. Ada juga kafe kecil di gedung perpustakaan yang populer untuk kopi dan makanan ringan, dan food court dekat Student Hub dengan berbagai pilihan masakan internasional. Kebanyakan mahasiswa menganggap food court sebagai tempat favorit mereka.\n\nMahasiswa: Kedengarannya luar biasa. Saya tidak sabar untuk mulai kuliah di sini!",
    "jlpt_level": null,
    "category": "conversation",
    "difficulty": 2,
    "duration_seconds": 90,
    "speakers": 2,
    "is_premium": false,
    "order_index": 2,
    "track": "ielts"
  },
  {
    "id": "listening-ielts-003",
    "title_jp": "Lecture: Climate Change Effects",
    "title_id": "Kuliah: Dampak Perubahan Iklim",
    "audio_url": null,
    "transcript_jp": "Professor: Good afternoon, class. Today we'll be examining the observable effects of climate change on global ecosystems. As you know from your readings, the Earth's average temperature has risen by approximately 1.1 degrees Celsius since the pre-industrial era, and this seemingly small change has had far-reaching consequences.\n\nLet's begin with the polar regions. The Arctic is warming at roughly twice the rate of the global average, a phenomenon known as Arctic amplification. This accelerated warming has caused dramatic reductions in sea ice extent. Satellite data shows that the Arctic has lost approximately 40 percent of its summer sea ice coverage since 1979. This loss has severe implications for species like polar bears, which depend on sea ice as a hunting platform for seals.\n\nMoving to the oceans, rising temperatures are causing widespread coral bleaching events. When water temperatures exceed normal ranges for extended periods, corals expel the symbiotic algae that provide them with both color and nutrition. The Great Barrier Reef has experienced four mass bleaching events since 2016, affecting more than two-thirds of its coral. Without adequate recovery time between events, many coral colonies are unable to survive.\n\nAnother significant impact is the alteration of precipitation patterns. Some regions are experiencing more intense and frequent rainfall, leading to flooding, while others face prolonged droughts. The Mediterranean region, for instance, has seen a 20 percent reduction in winter rainfall over the past 50 years, contributing to water scarcity and increased wildfire risk.\n\nPerhaps most concerning is the accelerating rate of species extinction. Current estimates suggest that species are disappearing at a rate 100 to 1,000 times higher than the natural background rate. Climate change is a major driver of this loss, as many species cannot adapt quickly enough to shifting temperature and precipitation patterns.\n\nFor next week's seminar, I'd like you to research one specific ecosystem and analyze how climate change is affecting its biodiversity. Please prepare a five-minute presentation for the group.",
    "transcript_reading": null,
    "transcript_id": "Profesor: Selamat siang, kelas. Hari ini kita akan memeriksa dampak perubahan iklim yang dapat diamati pada ekosistem global. Seperti yang kalian ketahui dari bacaan, suhu rata-rata Bumi telah naik sekitar 1,1 derajat Celsius sejak era pra-industri, dan perubahan yang tampaknya kecil ini memiliki konsekuensi yang luas.\n\nMari kita mulai dengan wilayah kutub. Arktik memanas sekitar dua kali lipat dari rata-rata global, sebuah fenomena yang dikenal sebagai amplifikasi Arktik. Pemanasan yang dipercepat ini telah menyebabkan pengurangan dramatis dalam luasan es laut. Data satelit menunjukkan bahwa Arktik telah kehilangan sekitar 40 persen dari cakupan es laut musim panasnya sejak 1979. Kehilangan ini memiliki implikasi serius bagi spesies seperti beruang kutub, yang bergantung pada es laut sebagai platform berburu anjing laut.\n\nBeralih ke lautan, peningkatan suhu menyebabkan peristiwa pemutihan karang yang meluas. Ketika suhu air melebihi rentang normal untuk periode yang lama, karang mengeluarkan alga simbiotik yang memberi mereka warna dan nutrisi. Great Barrier Reef telah mengalami empat peristiwa pemutihan massal sejak 2016, mempengaruhi lebih dari dua pertiga karangnya. Tanpa waktu pemulihan yang memadai antara peristiwa, banyak koloni karang tidak dapat bertahan.\n\nDampak signifikan lainnya adalah perubahan pola curah hujan. Beberapa wilayah mengalami hujan yang lebih intens dan sering, menyebabkan banjir, sementara yang lain menghadapi kekeringan berkepanjangan. Wilayah Mediterania, misalnya, telah mengalami penurunan 20 persen dalam curah hujan musim dingin selama 50 tahun terakhir, berkontribusi pada kelangkaan air dan peningkatan risiko kebakaran hutan.\n\nYang mungkin paling mengkhawatirkan adalah tingkat kepunahan spesies yang semakin cepat. Perkiraan saat ini menunjukkan bahwa spesies menghilang pada tingkat 100 hingga 1.000 kali lebih tinggi dari tingkat alami. Perubahan iklim adalah pendorong utama kehilangan ini, karena banyak spesies tidak dapat beradaptasi cukup cepat terhadap pergeseran pola suhu dan curah hujan.\n\nUntuk seminar minggu depan, saya ingin kalian meneliti satu ekosistem tertentu dan menganalisis bagaimana perubahan iklim mempengaruhi keanekaragaman hayatinya. Silakan siapkan presentasi lima menit untuk kelompok.",
    "jlpt_level": null,
    "category": "lecture",
    "difficulty": 3,
    "duration_seconds": 150,
    "speakers": 1,
    "is_premium": false,
    "order_index": 3,
    "track": "ielts"
  },
  {
    "id": "listening-ielts-004",
    "title_jp": "Student Housing Discussion",
    "title_id": "Diskusi Perumahan Mahasiswa",
    "audio_url": null,
    "transcript_jp": "Advisor: Hello, please have a seat. I understand you're looking for information about student accommodation options?\n\nStudent: Yes, that's right. I've been living in the dormitory this year, but I'm thinking about moving off-campus for my second year. I wanted to understand what options are available.\n\nAdvisor: Sure, I can help with that. Let me outline the main choices. First, you could stay in university accommodation. We have several residence halls, and second-year students are eligible for the newer apartments in Parkside Village. These are self-catered, meaning you cook for yourself, and they come furnished with a single bedroom, a shared kitchen, and a shared bathroom between two people.\n\nStudent: What's the cost for those?\n\nAdvisor: Parkside Village apartments are 650 pounds per month, which includes all utilities — electricity, water, heating, and internet. The contract runs for 44 weeks, covering the full academic year.\n\nStudent: And what about renting privately?\n\nAdvisor: Private rentals can be more affordable, especially if you share a house with other students. The average rent for a room in a shared house in this area is around 450 to 550 pounds per month. However, you'll need to budget separately for utilities, which typically add another 80 to 100 pounds per month. You'll also need to pay a deposit, usually equivalent to one month's rent.\n\nStudent: That's helpful. Are there any things I should watch out for when renting privately?\n\nAdvisor: Definitely. Always make sure the landlord is registered with the local council and that the property has a valid gas safety certificate and an energy performance certificate. I'd also recommend checking the property's condition thoroughly before signing any contract and taking photographs as evidence. Our student union offers a free contract-checking service, which I strongly recommend using.\n\nStudent: That's great advice. I think I'll look into both options and compare. Could I make another appointment to discuss this further once I've done some research?\n\nAdvisor: Absolutely. You can book online or just drop in during our open hours, which are Tuesday and Thursday afternoons from 2 to 5 PM.",
    "transcript_reading": null,
    "transcript_id": "Penasihat: Halo, silakan duduk. Saya dengar Anda mencari informasi tentang pilihan akomodasi mahasiswa?\n\nMahasiswa: Ya, benar. Saya tinggal di asrama tahun ini, tetapi saya berpikir untuk pindah ke luar kampus untuk tahun kedua saya. Saya ingin memahami pilihan apa saja yang tersedia.\n\nPenasihat: Tentu, saya bisa membantu. Izinkan saya menjelaskan pilihan utama. Pertama, Anda bisa tetap di akomodasi universitas. Kami memiliki beberapa gedung asrama, dan mahasiswa tahun kedua memenuhi syarat untuk apartemen baru di Parkside Village. Ini swa-katering, artinya Anda memasak sendiri, dan dilengkapi dengan kamar tidur tunggal, dapur bersama, dan kamar mandi bersama antara dua orang.\n\nMahasiswa: Berapa biayanya?\n\nPenasihat: Apartemen Parkside Village adalah 650 pound per bulan, yang sudah termasuk semua utilitas — listrik, air, pemanas, dan internet. Kontraknya berjalan selama 44 minggu, mencakup seluruh tahun akademik.\n\nMahasiswa: Dan bagaimana dengan menyewa secara pribadi?\n\nPenasihat: Sewa pribadi bisa lebih terjangkau, terutama jika Anda berbagi rumah dengan mahasiswa lain. Rata-rata sewa untuk kamar di rumah bersama di daerah ini sekitar 450 hingga 550 pound per bulan. Namun, Anda perlu menganggarkan terpisah untuk utilitas, yang biasanya menambah 80 hingga 100 pound per bulan. Anda juga perlu membayar deposit, biasanya setara dengan satu bulan sewa.\n\nMahasiswa: Itu membantu. Apakah ada hal yang harus saya perhatikan saat menyewa secara pribadi?\n\nPenasihat: Pasti. Selalu pastikan pemilik terdaftar di dewan lokal dan properti memiliki sertifikat keamanan gas yang valid dan sertifikat kinerja energi. Saya juga menyarankan untuk memeriksa kondisi properti secara menyeluruh sebelum menandatangani kontrak dan mengambil foto sebagai bukti. Serikat mahasiswa kami menawarkan layanan pengecekan kontrak gratis, yang sangat saya rekomendasikan.\n\nMahasiswa: Itu saran yang bagus. Saya pikir saya akan melihat kedua pilihan dan membandingkan. Bisakah saya membuat janji lagi untuk membahas ini lebih lanjut setelah saya melakukan riset?\n\nPenasihat: Tentu saja. Anda bisa memesan online atau langsung datang selama jam buka kami, yaitu Selasa dan Kamis sore dari jam 2 sampai 5 sore.",
    "jlpt_level": null,
    "category": "conversation",
    "difficulty": 3,
    "duration_seconds": 90,
    "speakers": 2,
    "is_premium": true,
    "order_index": 4,
    "track": "ielts"
  },
  {
    "id": "listening-ielts-005",
    "title_jp": "Lecture: Archaeological Methods",
    "title_id": "Kuliah: Metode Arkeologi",
    "audio_url": null,
    "transcript_jp": "Professor: Today I want to discuss the methods archaeologists use to uncover and interpret the past. Archaeology is fundamentally a science of recovery — we piece together human history from the physical remains left behind by previous civilizations.\n\nThe first and perhaps most critical step in any archaeological investigation is the survey. Before excavation begins, archaeologists must identify promising sites. This is done through a combination of techniques, including aerial photography, satellite imagery, and ground-penetrating radar. These remote sensing technologies allow researchers to detect buried structures, old roadways, and other features without disturbing the ground.\n\nOnce a site has been identified, excavation proceeds with meticulous care. The site is divided into a grid system, and each square is excavated layer by layer, a process called stratigraphic excavation. This method is based on the principle of superposition — the idea that in undisturbed deposits, older materials lie beneath more recent ones. By recording the precise location and depth of every artifact, archaeologists can reconstruct the chronological sequence of human activity at a site.\n\nDating techniques are essential for establishing when artifacts and structures were created or used. Radiocarbon dating, which measures the decay of carbon-14 in organic materials, is one of the most widely used methods and can date objects up to approximately 50,000 years old. For older materials, potassium-argon dating and luminescence dating provide alternative approaches. Dendrochronology, or tree-ring dating, offers extremely precise dates by matching the patterns of growth rings in ancient wood samples to established chronological sequences.\n\nThe analysis phase involves examining recovered artifacts in laboratory settings. Pottery fragments, stone tools, metal objects, and organic remains are all studied to understand the technologies, trade networks, dietary habits, and social structures of past societies. Modern techniques such as DNA analysis and isotope studies have revolutionized our ability to determine the geographic origins and migration patterns of ancient populations.\n\nFor your assignment, I'd like each of you to choose one dating technique and prepare a detailed report on its methodology, applications, and limitations.",
    "transcript_reading": null,
    "transcript_id": "Profesor: Hari ini saya ingin membahas metode yang digunakan arkeolog untuk mengungkap dan menafsirkan masa lalu. Arkeologi pada dasarnya adalah ilmu pemulihan — kita merangkai sejarah manusia dari sisa-sisa fisik yang ditinggalkan oleh peradaban sebelumnya.\n\nLangkah pertama dan mungkin paling penting dalam penyelidikan arkeologi adalah survei. Sebelum penggalian dimulai, arkeolog harus mengidentifikasi situs yang menjanjikan. Ini dilakukan melalui kombinasi teknik, termasuk fotografi udara, citra satelit, dan radar penembus tanah. Teknologi penginderaan jauh ini memungkinkan peneliti mendeteksi struktur terkubur, jalan lama, dan fitur lainnya tanpa mengganggu tanah.\n\nSetelah situs diidentifikasi, penggalian dilakukan dengan sangat hati-hati. Situs dibagi menjadi sistem grid, dan setiap kotak digali lapis demi lapis, proses yang disebut penggalian stratigrafi. Metode ini didasarkan pada prinsip superposisi — gagasan bahwa dalam deposit yang tidak terganggu, material yang lebih tua terletak di bawah yang lebih baru. Dengan mencatat lokasi dan kedalaman tepat setiap artefak, arkeolog dapat merekonstruksi urutan kronologis aktivitas manusia di suatu situs.\n\nTeknik penanggalan sangat penting untuk menetapkan kapan artefak dan struktur dibuat atau digunakan. Penanggalan radiokarbon, yang mengukur peluruhan karbon-14 dalam material organik, adalah salah satu metode yang paling banyak digunakan dan dapat menentukan usia objek hingga sekitar 50.000 tahun. Untuk material yang lebih tua, penanggalan potasium-argon dan penanggalan luminesensi memberikan pendekatan alternatif. Dendrokronologi, atau penanggalan cincin pohon, menawarkan tanggal yang sangat tepat dengan mencocokkan pola cincin pertumbuhan dalam sampel kayu kuno dengan urutan kronologis yang sudah ditetapkan.\n\nFase analisis melibatkan pemeriksaan artefak yang ditemukan di laboratorium. Pecahan tembikar, alat batu, objek logam, dan sisa-sisa organik semuanya dipelajari untuk memahami teknologi, jaringan perdagangan, kebiasaan makan, dan struktur sosial masyarakat masa lalu. Teknik modern seperti analisis DNA dan studi isotop telah merevolusi kemampuan kita untuk menentukan asal geografis dan pola migrasi populasi kuno.\n\nUntuk tugas kalian, saya ingin masing-masing memilih satu teknik penanggalan dan menyiapkan laporan terperinci tentang metodologi, aplikasi, dan keterbatasannya.",
    "jlpt_level": null,
    "category": "lecture",
    "difficulty": 4,
    "duration_seconds": 160,
    "speakers": 1,
    "is_premium": true,
    "order_index": 5,
    "track": "ielts"
  },
  {
    "id": "listening-toefl-001",
    "title_jp": "Office Hours: Course Selection",
    "title_id": "Jam Konsultasi: Pemilihan Mata Kuliah",
    "audio_url": null,
    "transcript_jp": "Student: Professor Adams, thank you for seeing me. I'm having trouble deciding which elective courses to take next semester.\n\nProfessor: Of course, happy to help. What's your major again?\n\nStudent: I'm majoring in Psychology, and I need two more electives to complete my degree requirements.\n\nProfessor: Alright. What areas interest you? Are you thinking about clinical psychology, research methods, or something more interdisciplinary?\n\nStudent: I'm really interested in how psychology connects to business, actually. I've been thinking about going into organizational consulting after graduation.\n\nProfessor: In that case, I'd strongly recommend our Organizational Behavior course. It covers topics like leadership theory, team dynamics, and motivation in the workplace. It's offered on Tuesdays and Thursdays at 2 PM.\n\nStudent: That sounds perfect. What about the second elective?\n\nProfessor: Well, if you're interested in consulting, you'll need strong research and data analysis skills. Our Applied Statistics course would be extremely valuable. Companies want consultants who can interpret data and present evidence-based recommendations.\n\nStudent: I've heard that course is quite challenging, though.\n\nProfessor: It is demanding, but Professor Williams is an excellent instructor. She uses real-world case studies and provides plenty of support during office hours. Students who complete it consistently say it was one of the most useful courses they took.\n\nStudent: Alright, I'm convinced. I'll register for both courses. Is there anything else you'd suggest I do to prepare for a career in consulting?\n\nProfessor: I'd recommend joining the Business Psychology Club. They organize networking events with professionals in the field, and they run a mentorship program that pairs students with alumni who work in consulting firms.\n\nStudent: That's a great idea. Thank you so much, Professor!\n\nProfessor: My pleasure. Come see me anytime if you have more questions.",
    "transcript_reading": null,
    "transcript_id": "Mahasiswa: Profesor Adams, terima kasih sudah menemui saya. Saya kesulitan memutuskan mata kuliah pilihan mana yang harus saya ambil semester depan.\n\nProfesor: Tentu, dengan senang hati membantu. Jurusan Anda apa lagi?\n\nMahasiswa: Saya jurusan Psikologi, dan saya butuh dua mata kuliah pilihan lagi untuk menyelesaikan persyaratan gelar saya.\n\nProfesor: Baiklah. Bidang apa yang menarik minat Anda? Apakah Anda memikirkan psikologi klinis, metode penelitian, atau sesuatu yang lebih interdisipliner?\n\nMahasiswa: Saya sangat tertarik pada bagaimana psikologi berhubungan dengan bisnis, sebenarnya. Saya berpikir untuk masuk ke konsultan organisasi setelah lulus.\n\nProfesor: Kalau begitu, saya sangat merekomendasikan mata kuliah Perilaku Organisasi kami. Mata kuliah ini mencakup topik seperti teori kepemimpinan, dinamika tim, dan motivasi di tempat kerja. Ditawarkan pada hari Selasa dan Kamis pukul 2 siang.\n\nMahasiswa: Kedengarannya sempurna. Bagaimana dengan pilihan kedua?\n\nProfesor: Nah, jika Anda tertarik pada konsultan, Anda akan membutuhkan keterampilan penelitian dan analisis data yang kuat. Mata kuliah Statistik Terapan kami akan sangat berharga. Perusahaan menginginkan konsultan yang bisa menafsirkan data dan menyajikan rekomendasi berbasis bukti.\n\nMahasiswa: Saya dengar mata kuliah itu cukup menantang, ya.\n\nProfesor: Memang menuntut, tetapi Profesor Williams adalah instruktur yang sangat baik. Dia menggunakan studi kasus dunia nyata dan memberikan banyak dukungan selama jam konsultasi. Mahasiswa yang menyelesaikannya secara konsisten mengatakan itu adalah salah satu mata kuliah paling berguna yang mereka ambil.\n\nMahasiswa: Baiklah, saya yakin. Saya akan mendaftar untuk kedua mata kuliah. Apakah ada hal lain yang Anda sarankan untuk mempersiapkan karier di bidang konsultan?\n\nProfesor: Saya sarankan bergabung dengan Klub Psikologi Bisnis. Mereka mengadakan acara networking dengan profesional di bidang tersebut, dan mereka menjalankan program mentoring yang memasangkan mahasiswa dengan alumni yang bekerja di firma konsultan.\n\nMahasiswa: Itu ide bagus. Terima kasih banyak, Profesor!\n\nProfesor: Dengan senang hati. Datang temui saya kapan saja jika ada pertanyaan lagi.",
    "jlpt_level": null,
    "category": "conversation",
    "difficulty": 1,
    "duration_seconds": 75,
    "speakers": 2,
    "is_premium": false,
    "order_index": 6,
    "track": "toefl"
  },
  {
    "id": "listening-toefl-002",
    "title_jp": "Professor-Student: Research Paper",
    "title_id": "Profesor-Mahasiswa: Makalah Penelitian",
    "audio_url": null,
    "transcript_jp": "Student: Professor Lee, I wanted to talk about my research paper for the biology seminar. I've been struggling to narrow down my topic.\n\nProfessor: Sure, let's discuss it. What general area were you considering?\n\nStudent: I was thinking about writing on antibiotic resistance, but when I started researching, I realized the topic is enormous. There are so many different angles I could take.\n\nProfessor: You're right, antibiotic resistance is a broad subject. The key is to find a specific focus. Are you more interested in the biological mechanisms of resistance, the public health implications, or perhaps the agricultural use of antibiotics?\n\nStudent: I think the agricultural angle is really interesting. I read an article about how antibiotics used in livestock farming contribute to the development of resistant bacteria.\n\nProfessor: That's an excellent focus. The use of antibiotics as growth promoters in animal agriculture is a significant contributor to resistance, and it's a topic with strong policy implications. You could examine how different countries have approached regulation of agricultural antibiotic use.\n\nStudent: That's a great idea! I know the European Union banned antibiotics as growth promoters back in 2006. I could compare their approach with what's been done in the United States.\n\nProfessor: Exactly. And you should look at the research showing whether those bans have actually reduced resistance rates. That would give your paper a nice analytical component rather than just being descriptive.\n\nStudent: Should I include primary research data, or is a literature review sufficient for this assignment?\n\nProfessor: A thorough literature review is appropriate for this assignment. Focus on peer-reviewed journal articles published within the last ten years. I'd recommend using databases like PubMed and Web of Science. Aim for at least fifteen to twenty sources.\n\nStudent: Got it. What about the paper's length?\n\nProfessor: Between 3,000 and 4,000 words, not including references. The draft is due in three weeks, so plan your time accordingly.\n\nStudent: Thank you, Professor. This has really helped clarify my direction.",
    "transcript_reading": null,
    "transcript_id": "Mahasiswa: Profesor Lee, saya ingin berbicara tentang makalah penelitian saya untuk seminar biologi. Saya kesulitan mempersempit topik saya.\n\nProfesor: Tentu, mari kita diskusikan. Bidang umum apa yang Anda pertimbangkan?\n\nMahasiswa: Saya berpikir untuk menulis tentang resistensi antibiotik, tetapi ketika saya mulai meneliti, saya menyadari topiknya sangat luas. Ada begitu banyak sudut pandang berbeda yang bisa saya ambil.\n\nProfesor: Anda benar, resistensi antibiotik adalah subjek yang luas. Kuncinya adalah menemukan fokus yang spesifik. Apakah Anda lebih tertarik pada mekanisme biologis resistensi, implikasi kesehatan masyarakat, atau mungkin penggunaan antibiotik dalam pertanian?\n\nMahasiswa: Saya pikir sudut pandang pertanian sangat menarik. Saya membaca artikel tentang bagaimana antibiotik yang digunakan dalam peternakan berkontribusi pada perkembangan bakteri resisten.\n\nProfesor: Itu fokus yang sangat baik. Penggunaan antibiotik sebagai pemicu pertumbuhan dalam pertanian hewan adalah kontributor signifikan terhadap resistensi, dan ini topik dengan implikasi kebijakan yang kuat. Anda bisa memeriksa bagaimana berbagai negara mendekati regulasi penggunaan antibiotik pertanian.\n\nMahasiswa: Itu ide bagus! Saya tahu Uni Eropa melarang antibiotik sebagai pemicu pertumbuhan pada tahun 2006. Saya bisa membandingkan pendekatan mereka dengan apa yang dilakukan di Amerika Serikat.\n\nProfesor: Tepat. Dan Anda harus melihat penelitian yang menunjukkan apakah larangan tersebut benar-benar mengurangi tingkat resistensi. Itu akan memberikan komponen analitis yang bagus untuk makalah Anda, bukan hanya deskriptif.\n\nMahasiswa: Haruskah saya menyertakan data penelitian primer, atau tinjauan pustaka sudah cukup untuk tugas ini?\n\nProfesor: Tinjauan pustaka yang menyeluruh sudah tepat untuk tugas ini. Fokus pada artikel jurnal peer-review yang diterbitkan dalam sepuluh tahun terakhir. Saya sarankan menggunakan database seperti PubMed dan Web of Science. Targetkan setidaknya lima belas hingga dua puluh sumber.\n\nMahasiswa: Mengerti. Bagaimana dengan panjang makalahnya?\n\nProfesor: Antara 3.000 dan 4.000 kata, tidak termasuk referensi. Draf harus diserahkan dalam tiga minggu, jadi rencanakan waktu Anda dengan baik.\n\nMahasiswa: Terima kasih, Profesor. Ini sangat membantu memperjelas arah saya.",
    "jlpt_level": null,
    "category": "conversation",
    "difficulty": 2,
    "duration_seconds": 85,
    "speakers": 2,
    "is_premium": false,
    "order_index": 7,
    "track": "toefl"
  },
  {
    "id": "listening-toefl-003",
    "title_jp": "Lecture: Plate Tectonics",
    "title_id": "Kuliah: Tektonik Lempeng",
    "audio_url": null,
    "transcript_jp": "Professor: Alright, everyone, today we're going to delve into the mechanism that drives plate tectonics — specifically, what causes these massive slabs of rock to move across Earth's surface. Now, you've already learned that the Earth's outer layer, the lithosphere, is broken into about fifteen major tectonic plates. But what actually pushes them around?\n\nThe primary driving force is convection in the mantle. The Earth's interior is extremely hot, with temperatures in the core reaching over 5,000 degrees Celsius. This heat creates convection currents in the semi-fluid asthenosphere beneath the lithosphere. Hot material rises from deep within the mantle, spreads laterally along the base of the lithosphere, cools, and then sinks back down. These convection cells essentially act as a conveyor belt, dragging the overlying plates along with them.\n\nNow, there are three key forces that contribute to plate movement. The first is ridge push. At mid-ocean ridges, where new oceanic crust is formed, the elevated ridge creates a gravitational force that pushes the plate away from the ridge. Think of it as a gentle slope — the newly formed crust slides downhill away from the ridge.\n\nThe second force is slab pull, and this is actually considered the most significant driving force. When an oceanic plate meets a continental plate at a convergent boundary, the denser oceanic plate subducts beneath the continental plate. As this cold, dense slab of oceanic lithosphere sinks into the mantle, it pulls the rest of the plate behind it, much like a heavy tablecloth sliding off a table and dragging everything with it.\n\nThe third force is basal drag, which is the friction between the convection currents in the asthenosphere and the base of the lithospheric plate. However, the exact contribution of basal drag is still debated among geophysicists, as it could either drive or resist plate motion depending on the relative velocities of the plate and the underlying mantle flow.\n\nFor next class, please read chapter seven on earthquake seismology, as we'll be discussing how plate boundaries generate seismic activity.",
    "transcript_reading": null,
    "transcript_id": "Profesor: Baiklah, semuanya, hari ini kita akan mendalami mekanisme yang menggerakkan tektonik lempeng — khususnya, apa yang menyebabkan lempengan batu raksasa ini bergerak melintasi permukaan Bumi. Sekarang, kalian sudah belajar bahwa lapisan terluar Bumi, litosfer, terbagi menjadi sekitar lima belas lempeng tektonik utama. Tapi apa sebenarnya yang mendorongnya?\n\nGaya penggerak utama adalah konveksi di mantel. Interior Bumi sangat panas, dengan suhu di inti mencapai lebih dari 5.000 derajat Celsius. Panas ini menciptakan arus konveksi di astenosfer semi-cair di bawah litosfer. Material panas naik dari dalam mantel, menyebar secara lateral di sepanjang dasar litosfer, mendingin, dan kemudian turun kembali. Sel konveksi ini pada dasarnya bertindak sebagai sabuk konveyor, menyeret lempeng di atasnya.\n\nSekarang, ada tiga gaya utama yang berkontribusi pada pergerakan lempeng. Yang pertama adalah dorongan punggung bukit. Di punggung bukit tengah samudera, di mana kerak samudera baru terbentuk, punggung bukit yang terangkat menciptakan gaya gravitasi yang mendorong lempeng menjauh dari punggung bukit. Bayangkan seperti lereng landai — kerak yang baru terbentuk meluncur menuruni bukit menjauh dari punggung bukit.\n\nGaya kedua adalah tarikan lempengan, dan ini sebenarnya dianggap sebagai gaya penggerak paling signifikan. Ketika lempeng samudera bertemu lempeng benua di batas konvergen, lempeng samudera yang lebih padat menunjam di bawah lempeng benua. Saat lempengan litosfer samudera yang dingin dan padat ini tenggelam ke dalam mantel, ia menarik sisa lempeng di belakangnya, mirip seperti taplak meja berat yang meluncur dari meja dan menyeret semuanya bersamanya.\n\nGaya ketiga adalah gesekan dasar, yaitu gesekan antara arus konveksi di astenosfer dan dasar lempeng litosfer. Namun, kontribusi pasti dari gesekan dasar masih diperdebatkan di kalangan geofisikawan, karena bisa mendorong atau menahan gerakan lempeng tergantung pada kecepatan relatif lempeng dan aliran mantel di bawahnya.\n\nUntuk kelas berikutnya, silakan baca bab tujuh tentang seismologi gempa bumi, karena kita akan membahas bagaimana batas lempeng menghasilkan aktivitas seismik.",
    "jlpt_level": null,
    "category": "lecture",
    "difficulty": 3,
    "duration_seconds": 155,
    "speakers": 1,
    "is_premium": false,
    "order_index": 8,
    "track": "toefl"
  },
  {
    "id": "listening-toefl-004",
    "title_jp": "Lecture: Baroque Music Period",
    "title_id": "Kuliah: Periode Musik Barok",
    "audio_url": null,
    "transcript_jp": "Professor: Today we're exploring the Baroque period in music, which spans roughly from 1600 to 1750. This era represents one of the most productive and innovative periods in Western music history, and it laid the groundwork for virtually everything that followed in classical music.\n\nThe Baroque period began in Italy, and the term itself comes from the Portuguese word 'barroco,' meaning an irregularly shaped pearl. Originally, it was used somewhat negatively to describe art and music that was considered overly ornate or exaggerated. Over time, however, the term lost its negative connotation and simply came to describe the artistic style of this era.\n\nOne of the most important developments of the Baroque period was the birth of opera. The earliest operas were composed in Florence around 1600 by members of the Camerata, a group of intellectuals who sought to revive the musical traditions of ancient Greek drama. Claudio Monteverdi's 'L'Orfeo,' composed in 1607, is generally regarded as the first great opera, combining dramatic storytelling with sophisticated musical expression.\n\nThe Baroque era also saw the development of several important musical forms and genres. The concerto, which features a solo instrument or small group of instruments playing against a full orchestra, became enormously popular. Antonio Vivaldi composed over 500 concertos, including 'The Four Seasons,' which remains one of the most frequently performed works in the classical repertoire. The fugue, a complex contrapuntal composition in which a theme is introduced and then developed through multiple voices, reached its highest expression in the works of Johann Sebastian Bach.\n\nSpeaking of Bach, he and George Frideric Handel are generally considered the two towering figures of the late Baroque period. Bach spent most of his career in Germany, composing an astonishing volume of sacred and secular music, including cantatas, organ works, and orchestral suites. Handel, though German-born, spent much of his career in England, where he became famous for his operas and oratorios, particularly 'Messiah.'\n\nThe Baroque period ended around 1750, the year of Bach's death, giving way to the Classical period with its emphasis on clarity, balance, and formal structure.",
    "transcript_reading": null,
    "transcript_id": "Profesor: Hari ini kita menjelajahi periode Barok dalam musik, yang berlangsung kira-kira dari tahun 1600 hingga 1750. Era ini mewakili salah satu periode paling produktif dan inovatif dalam sejarah musik Barat, dan meletakkan dasar untuk hampir semua yang mengikuti dalam musik klasik.\n\nPeriode Barok dimulai di Italia, dan istilah itu sendiri berasal dari kata Portugis 'barroco,' yang berarti mutiara berbentuk tidak beraturan. Awalnya, istilah ini digunakan agak negatif untuk menggambarkan seni dan musik yang dianggap terlalu berornamen atau berlebihan. Namun, seiring waktu, istilah ini kehilangan konotasi negatifnya dan hanya digunakan untuk menggambarkan gaya artistik era ini.\n\nSalah satu perkembangan terpenting dari periode Barok adalah lahirnya opera. Opera-opera paling awal dikomposisi di Firenze sekitar tahun 1600 oleh anggota Camerata, sekelompok intelektual yang berusaha menghidupkan kembali tradisi musik drama Yunani kuno. 'L'Orfeo' karya Claudio Monteverdi, yang dikomposisi pada tahun 1607, umumnya dianggap sebagai opera besar pertama, menggabungkan penceritaan dramatis dengan ekspresi musik yang canggih.\n\nEra Barok juga melihat perkembangan beberapa bentuk dan genre musik penting. Konserto, yang menampilkan instrumen solo atau kelompok kecil instrumen bermain melawan orkestra penuh, menjadi sangat populer. Antonio Vivaldi mengomposisi lebih dari 500 konserto, termasuk 'The Four Seasons,' yang tetap menjadi salah satu karya yang paling sering ditampilkan dalam repertoar klasik. Fuga, komposisi kontrapuntal kompleks di mana tema diperkenalkan dan kemudian dikembangkan melalui beberapa suara, mencapai ekspresi tertingginya dalam karya-karya Johann Sebastian Bach.\n\nBerbicara tentang Bach, dia dan George Frideric Handel umumnya dianggap sebagai dua tokoh besar periode Barok akhir. Bach menghabiskan sebagian besar kariernya di Jerman, mengomposisi volume musik sakral dan sekuler yang menakjubkan, termasuk kantata, karya organ, dan suite orkestra. Handel, meskipun lahir di Jerman, menghabiskan sebagian besar kariernya di Inggris, di mana ia menjadi terkenal karena opera dan oratorionya, terutama 'Messiah.'\n\nPeriode Barok berakhir sekitar tahun 1750, tahun kematian Bach, memberi jalan kepada periode Klasik dengan penekanannya pada kejelasan, keseimbangan, dan struktur formal.",
    "jlpt_level": null,
    "category": "lecture",
    "difficulty": 3,
    "duration_seconds": 165,
    "speakers": 1,
    "is_premium": true,
    "order_index": 9,
    "track": "toefl"
  },
  {
    "id": "listening-toefl-005",
    "title_jp": "Lecture: Animal Migration Patterns",
    "title_id": "Kuliah: Pola Migrasi Hewan",
    "audio_url": null,
    "transcript_jp": "Professor: Today's lecture focuses on animal migration — one of the most remarkable phenomena in the natural world. Migration is defined as the seasonal movement of animals from one region to another, typically driven by changes in food availability, weather conditions, or breeding requirements.\n\nLet's start with one of the most extraordinary examples: the Arctic tern. This small seabird undertakes the longest known migration of any animal, traveling approximately 70,000 kilometers round-trip each year between its Arctic breeding grounds and Antarctic feeding areas. Over its lifetime of about 30 years, an Arctic tern may travel the equivalent of three round trips to the moon.\n\nNow, what's particularly fascinating about migration is the navigational ability of these animals. How does a bird that weighs less than 150 grams find its way across thousands of kilometers of open ocean? Research has identified several navigational mechanisms. Many birds possess a magnetic sense that allows them to detect Earth's magnetic field, essentially giving them a built-in compass. They also use celestial navigation, orienting themselves by the position of the sun during the day and the stars at night. Additionally, some species appear to use olfactory cues, following scent gradients to locate specific destinations.\n\nMammalian migration presents equally impressive examples. The wildebeest migration in East Africa involves approximately 1.5 million animals moving in a circular pattern across the Serengeti-Mara ecosystem, covering about 3,000 kilometers annually. This migration is primarily driven by rainfall patterns and the resulting availability of fresh grazing land.\n\nMarine migrations are no less spectacular. Humpback whales travel up to 8,000 kilometers each way between their tropical breeding grounds and polar feeding areas. Gray whales undertake a similar journey along the Pacific coast of North America, traveling from breeding lagoons in Mexico to feeding grounds in the Bering Sea.\n\nClimate change is increasingly disrupting established migration patterns. As temperatures shift, the timing of seasonal events changes, creating mismatches between migrating animals and the food resources they depend on. Some bird species are arriving at their breeding grounds earlier, only to find that the insect populations they feed on have not yet emerged. This phenological mismatch is a growing concern for conservation biologists.\n\nFor your reading this week, I've assigned the chapter on migration ecology, focusing on the section about how human infrastructure such as roads, fences, and wind turbines creates barriers to animal movement.",
    "transcript_reading": null,
    "transcript_id": "Profesor: Kuliah hari ini berfokus pada migrasi hewan — salah satu fenomena paling luar biasa di dunia alam. Migrasi didefinisikan sebagai perpindahan musiman hewan dari satu wilayah ke wilayah lain, biasanya didorong oleh perubahan ketersediaan makanan, kondisi cuaca, atau kebutuhan berkembang biak.\n\nMari kita mulai dengan salah satu contoh paling luar biasa: burung layang-layang laut Arktik. Burung laut kecil ini melakukan migrasi terpanjang yang diketahui dari hewan manapun, menempuh jarak sekitar 70.000 kilometer pulang-pergi setiap tahun antara tempat berkembang biaknya di Arktik dan area makan di Antartika. Selama masa hidupnya sekitar 30 tahun, seekor burung layang-layang laut Arktik mungkin menempuh jarak setara dengan tiga kali perjalanan pulang-pergi ke bulan.\n\nSekarang, yang sangat menarik tentang migrasi adalah kemampuan navigasi hewan-hewan ini. Bagaimana seekor burung yang beratnya kurang dari 150 gram menemukan jalannya melintasi ribuan kilometer lautan terbuka? Penelitian telah mengidentifikasi beberapa mekanisme navigasi. Banyak burung memiliki indera magnetik yang memungkinkan mereka mendeteksi medan magnet Bumi, pada dasarnya memberi mereka kompas bawaan. Mereka juga menggunakan navigasi langit, mengorientasikan diri berdasarkan posisi matahari di siang hari dan bintang di malam hari. Selain itu, beberapa spesies tampaknya menggunakan isyarat penciuman, mengikuti gradien aroma untuk menemukan tujuan tertentu.\n\nMigrasi mamalia menyajikan contoh yang sama mengesankannya. Migrasi wildebeest di Afrika Timur melibatkan sekitar 1,5 juta hewan yang bergerak dalam pola melingkar melintasi ekosistem Serengeti-Mara, menempuh sekitar 3.000 kilometer setiap tahun. Migrasi ini terutama didorong oleh pola curah hujan dan ketersediaan lahan penggembalaan segar yang dihasilkan.\n\nMigrasi laut tidak kalah spektakuler. Paus bungkuk menempuh hingga 8.000 kilometer setiap arah antara tempat berkembang biak tropis dan area makan kutub. Paus abu-abu melakukan perjalanan serupa di sepanjang pantai Pasifik Amerika Utara, berpindah dari laguna berkembang biak di Meksiko ke area makan di Laut Bering.\n\nPerubahan iklim semakin mengganggu pola migrasi yang sudah mapan. Saat suhu bergeser, waktu peristiwa musiman berubah, menciptakan ketidakcocokan antara hewan yang bermigrasi dan sumber makanan yang mereka andalkan. Beberapa spesies burung tiba di tempat berkembang biak lebih awal, hanya untuk menemukan bahwa populasi serangga yang mereka makan belum muncul. Ketidakcocokan fenologis ini menjadi kekhawatiran yang berkembang bagi ahli biologi konservasi.\n\nUntuk bacaan minggu ini, saya menugaskan bab tentang ekologi migrasi, fokus pada bagian tentang bagaimana infrastruktur manusia seperti jalan, pagar, dan turbin angin menciptakan hambatan terhadap pergerakan hewan.",
    "jlpt_level": null,
    "category": "lecture",
    "difficulty": 4,
    "duration_seconds": 180,
    "speakers": 1,
    "is_premium": true,
    "order_index": 10,
    "track": "toefl"
  }
]