[
  {
    "id": "listening-n2-001",
    "title_jp": "ニュース放送",
    "title_id": "Siaran Berita",
    "audio_url": "",
    "transcript_jp": "本日のトップニュースです。政府は来年度の予算案を閣議決定しました。総額は約115兆円で、過去最大規模となります。社会保障費の増加に対応するため、歳出の見直しが進められています。一方、防衛費については、国際情勢の変化を踏まえ、前年度比で約10パーセントの増額となりました。野党は、財源の確保策が不十分であると批判しており、国会での議論が活発化する見通しです。",
    "transcript_reading": "ほんじつのトップニュースです。せいふはらいねんどのよさんあんをかくぎけっていしました。そうがくはやく115ちょうえんで、かこさいだいきぼとなります。",
    "transcript_id": "Berita utama hari ini. Pemerintah telah menyetujui rancangan anggaran untuk tahun fiskal berikutnya melalui keputusan kabinet. Total anggaran sekitar 115 triliun yen, menjadi yang terbesar sepanjang sejarah. Peninjauan pengeluaran sedang dilakukan untuk menghadapi peningkatan biaya jaminan sosial. Sementara itu, anggaran pertahanan meningkat sekitar 10 persen dari tahun sebelumnya mengingat perubahan situasi internasional. Partai oposisi mengkritik bahwa langkah pengamanan sumber dana tidak memadai, dan diskusi di parlemen diperkirakan akan semakin aktif.",
    "jlpt_level": "N2",
    "category": "news",
    "difficulty": 4,
    "duration_seconds": 45,
    "speakers": 1,
    "is_premium": false,
    "order_index": 1
  },
  {
    "id": "listening-n2-002",
    "title_jp": "ビジネス会議",
    "title_id": "Rapat Bisnis",
    "audio_url": "",
    "transcript_jp": "田中部長：それでは、今四半期の売上報告をお願いします。\n山田：はい。今四半期の売上は前年同期比で15パーセント増の4億2千万円となりました。特に、新製品の「スマートホーム」シリーズが好調で、予想を上回る売上を記録しています。\n田中部長：素晴らしい結果ですね。海外市場はどうですか。\n山田：東南アジア市場は順調に拡大しており、来期はさらに販路を広げる計画です。ただし、原材料費の高騰が利益率に影響を及ぼしている点が課題です。\n田中部長：コスト削減策について、次回の会議で具体的な提案をお願いします。",
    "transcript_reading": "",
    "transcript_id": "Manajer Tanaka: Kalau begitu, tolong laporkan penjualan kuartal ini.\nYamada: Baik. Penjualan kuartal ini mencapai 420 juta yen, naik 15 persen dibanding periode yang sama tahun lalu. Khususnya, seri produk baru 'Smart Home' terjual sangat baik, melampaui perkiraan.\nManajer Tanaka: Hasil yang luar biasa. Bagaimana pasar luar negeri?\nYamada: Pasar Asia Tenggara berkembang dengan baik, dan kami berencana memperluas jaringan distribusi kuartal depan. Namun, kenaikan biaya bahan baku mempengaruhi margin keuntungan, itu menjadi tantangan.\nManajer Tanaka: Tolong siapkan proposal spesifik tentang strategi pengurangan biaya untuk rapat berikutnya.",
    "jlpt_level": "N2",
    "category": "business",
    "difficulty": 3,
    "duration_seconds": 60,
    "speakers": 2,
    "is_premium": false,
    "order_index": 2
  },
  {
    "id": "listening-n2-003",
    "title_jp": "大学の講義",
    "title_id": "Kuliah Universitas",
    "audio_url": "",
    "transcript_jp": "今日の講義では、日本の高度経済成長期について学びます。1955年から1973年にかけて、日本は年平均約10パーセントという驚異的な経済成長を遂げました。この成長を支えた要因として、第一に、勤勉な労働力の存在が挙げられます。第二に、技術革新と設備投資の拡大があります。第三に、政府の産業政策による支援が重要な役割を果たしました。しかし、急速な経済成長は、公害問題や都市部への人口集中など、さまざまな社会問題も引き起こしました。次回は、この時期の光と影について、より詳しく見ていきましょう。",
    "transcript_reading": "",
    "transcript_id": "Pada kuliah hari ini, kita akan mempelajari periode pertumbuhan ekonomi tinggi Jepang. Dari tahun 1955 hingga 1973, Jepang mengalami pertumbuhan ekonomi luar biasa dengan rata-rata sekitar 10 persen per tahun. Faktor-faktor yang mendukung pertumbuhan ini antara lain: pertama, adanya tenaga kerja yang rajin. Kedua, inovasi teknologi dan peningkatan investasi peralatan. Ketiga, dukungan dari kebijakan industri pemerintah memainkan peran penting. Namun, pertumbuhan ekonomi yang cepat juga menyebabkan berbagai masalah sosial seperti polusi dan konsentrasi penduduk di kota-kota besar. Pada pertemuan selanjutnya, kita akan melihat sisi terang dan gelap dari periode ini secara lebih detail.",
    "jlpt_level": "N2",
    "category": "academic",
    "difficulty": 4,
    "duration_seconds": 55,
    "speakers": 1,
    "is_premium": false,
    "order_index": 3
  },
  {
    "id": "listening-n2-004",
    "title_jp": "インタビュー",
    "title_id": "Wawancara",
    "audio_url": "",
    "transcript_jp": "記者：先生は30年以上にわたって伝統工芸品の制作に携わっていらっしゃいますが、この仕事を始めたきっかけは何でしたか。\n職人：祖父が漆器の職人でして、子どもの頃から作業場で遊んでいました。大学では全く別の分野を学んだのですが、卒業後に祖父の技術が失われてしまうことに危機感を覚え、弟子入りを決めました。\n記者：後継者の育成についてはどのようにお考えですか。\n職人：技術を次の世代に伝えることは、私の最も重要な使命だと考えています。最近は、若い人たちが伝統工芸に興味を持ってくれるようになり、心強く感じています。",
    "transcript_reading": "",
    "transcript_id": "Reporter: Anda telah terlibat dalam pembuatan kerajinan tradisional selama lebih dari 30 tahun. Apa yang membuat Anda memulai pekerjaan ini?\nPengrajin: Kakek saya adalah pengrajin pernis, dan saya bermain di bengkelnya sejak kecil. Di universitas saya belajar bidang yang sama sekali berbeda, tapi setelah lulus saya merasa cemas bahwa teknik kakek saya akan hilang, jadi saya memutuskan untuk menjadi muridnya.\nReporter: Bagaimana pandangan Anda tentang pelatihan penerus?\nPengrajin: Saya menganggap meneruskan teknik ke generasi berikutnya sebagai misi terpenting saya. Belakangan ini, saya merasa terdorong karena anak-anak muda mulai menunjukkan minat pada kerajinan tradisional.",
    "jlpt_level": "N2",
    "category": "interview",
    "difficulty": 3,
    "duration_seconds": 50,
    "speakers": 2,
    "is_premium": true,
    "order_index": 4
  },
  {
    "id": "listening-n2-005",
    "title_jp": "天気予報と交通情報",
    "title_id": "Ramalan Cuaca dan Informasi Lalu Lintas",
    "audio_url": "",
    "transcript_jp": "続いて、明日の天気予報です。関東地方は午前中は晴れますが、午後から次第に雲が広がり、夕方以降は広い範囲で雨が降る見込みです。最高気温は18度で、平年並みとなるでしょう。お出かけの際は、折りたたみ傘をお持ちになることをお勧めします。\n\n続いて交通情報です。中央自動車道は、八王子インターチェンジ付近で発生した事故の影響により、上り線で約5キロメートルの渋滞が発生しています。通過に約30分かかる見込みです。ご注意ください。",
    "transcript_reading": "",
    "transcript_id": "Selanjutnya, ramalan cuaca untuk besok. Di wilayah Kanto, pagi hari akan cerah, tetapi awan akan menyebar secara bertahap mulai siang, dan hujan diperkirakan akan turun di area luas mulai sore hari. Suhu tertinggi akan sekitar 18 derajat, normal untuk musim ini. Jika Anda bepergian, kami sarankan membawa payung lipat.\n\nSelanjutnya informasi lalu lintas. Di jalan tol Chuo, terjadi kemacetan sepanjang sekitar 5 kilometer di jalur naik akibat kecelakaan di dekat gerbang tol Hachioji. Diperkirakan butuh sekitar 30 menit untuk melewatinya. Harap berhati-hati.",
    "jlpt_level": "N2",
    "category": "announcement",
    "difficulty": 3,
    "duration_seconds": 40,
    "speakers": 1,
    "is_premium": false,
    "order_index": 5
  }
]
